Revit 2024 API
Transform2D Class
 An affine transform of 2D Euclidean space.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2021
Syntax
C#
public class Transform2D : IDisposable
Visual Basic
Public Class Transform2D _
	Implements IDisposable
Visual C++
public ref class Transform2D : IDisposable
Remarks
 An affine transform is a linear transform plus a translation (which may be zero). Some functions only accept certain kinds of transform (e.g., rigid motion, conformal, non-singular, etc.).
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.Transform2D
See Also
Transform2D Members
Autodesk.Revit.DB Namespace